# 25 Best Tricks in Pandas

https://www.youtube.com/watch?v=RlIiVeig3hc

In [1]:
import numpy as np
import pandas as pd

In [2]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep = '\t')
orders['item_price'] = orders.item_price.str.replace('$','').astype=('float')

stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates = ['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates = ['Time'])

# 1. Show installed Versions of Panda

In [4]:
pd.__version__

'0.24.2'

In [7]:
# to find out all dependancy 

pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.7.3.final.0
python-bits: 64
OS: Windows
OS-release: 10
machine: AMD64
processor: Intel64 Family 6 Model 142 Stepping 10, GenuineIntel
byteorder: little
LC_ALL: None
LANG: None
LOCALE: None.None

pandas: 0.24.2
pytest: 5.0.1
pip: 19.1.1
setuptools: 41.0.1
Cython: 0.29.12
numpy: 1.16.4
scipy: 1.2.1
pyarrow: None
xarray: None
IPython: 7.6.1
sphinx: 2.1.2
patsy: 0.5.1
dateutil: 2.8.0
pytz: 2019.1
blosc: None
bottleneck: 1.2.1
tables: 3.5.2
numexpr: 2.6.9
feather: None
matplotlib: 3.1.0
openpyxl: 2.6.2
xlrd: 1.2.0
xlwt: 1.3.0
xlsxwriter: 1.1.8
lxml.etree: 4.3.4
bs4: 4.7.1
html5lib: 1.0.1
sqlalchemy: 1.3.5
pymysql: None
psycopg2: None
jinja2: 2.10.1
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: 0.8.1
gcsfs: None

# 2. Create an Example DataFrame

In [8]:
df = pd.DataFrame({'col_one' : [100,200], 'col_two':[400,500]})
df

   col_one  col_two
0      100      400
1      200      500

In [10]:
# creating DataFRame using Numpy Array

pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.673096,0.801236,0.593851,0.887712,0.464500,0.861511,0.685982,0.684865
1,0.482501,0.678121,0.246970,0.093811,0.161366,0.163232,0.555085,0.771932
2,0.672901,0.190550,0.825377,0.138757,0.538935,0.576195,0.443640,0.435446
3,0.202645,0.090468,0.864379,0.780498,0.200914,0.230688,0.983750,0.455560

In [14]:
df = pd.DataFrame(np.random.rand(4,8), columns = list('abcdefgh'))
df

,a,b,c,d,e,f,g,h
0,0.664653,0.181347,0.116704,0.680799,0.176515,0.725084,0.683941,0.701217
1,0.268658,0.951034,0.200841,0.252305,0.519913,0.828175,0.216479,0.079977
2,0.480514,0.783736,0.229012,0.709306,0.359410,0.918101,0.071115,0.617631
3,0.003815,0.740488,0.207794,0.491091,0.007964,0.783049,0.788421,0.311553

# 3. Rename Columns

In [18]:
df = pd.DataFrame({'col one' : [100,200], 'col two':[400,500]})
df

   col one  col two
0      100      400
1      200      500

In [21]:
df.rename(columns ={'col one':'col_one', 'col two': 'col_two'} )

   col_one  col_two
0      100      400
1      200      500

In [22]:
# To change all column Name in DataFrame

df.columns = ['col one', 'col two']

### replacement method

In [24]:
df

   col one  col two
0      100      400
1      200      500

In [27]:
df.columns = df.columns.str.replace(' ', '_')
df

   col_one  col_two
0      100      400
1      200      500

In [28]:
# to add prefix 

df.add_prefix('X_')

   X_col_one  X_col_two
0        100        400
1        200        500

In [29]:
# to Add suffix 

df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        400
1        200        500

### 4.  Reverse Row Order

In [30]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [31]:
drinks.loc[::-1].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

In [32]:
# reverse row with reseting index 

drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

### 5. Reverse Column Order

In [34]:
drinks.loc[:,::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

### 6. Select column by Data Type

In [35]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [38]:
drinks.head(2)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe

In [39]:
# only to get the columns having numeric value

drinks.select_dtypes(include = 'number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [40]:
# only to get object column

drinks.select_dtypes(include = 'object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [42]:
# include specific column

drinks.select_dtypes(include= ['number', 'object','category', 'datetime']).head(2)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe

In [43]:
# excluding number column 

drinks.select_dtypes(exclude = 'number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

### 7. converting strings to number

In [44]:
df = pd.DataFrame({'col_one': ['1.1','2.2','3.3'],
                  'col_two': ['4.4','5.5','6.6'],
                  'col_three': ['7.7','8.8','-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [46]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [49]:
df.astype({'col_one':'float', 'col_two':'float'})

   col_one  col_two col_three
0      1.1      4.4       7.7
1      2.2      5.5       8.8
2      3.3      6.6         -

In [50]:
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [53]:
pd.to_numeric(df.col_three, errors = 'coerce')

# If ‘coerce’, then invalid parsing will be set as NaN.

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_numeric.html